![piggy_bank](piggy_bank.jpg)

<br>

Personal loans are a lucrative revenue stream for banks. The typical interest rate of a two year loan in the United Kingdom is [around 10%](https://www.experian.com/blogs/ask-experian/whats-a-good-interest-rate-for-a-personal-loan/). This might not sound like a lot, but in September 2022 alone UK consumers borrowed [around £1.5 billion](https://www.ukfinance.org.uk/system/files/2022-12/Household%20Finance%20Review%202022%20Q3-%20Final.pdf), which would mean approximately £300 million in interest generated by banks over two years!

You have been asked to work with a bank to clean and store the data they collected as part of a recent marketing campaign, which aimed to get customers to take out a personal loan. They plan to conduct more marketing campaigns going forward so would like you to set up a PostgreSQL database to store this campaign's data, designing the schema in a way that would allow data from future campaigns to be easily imported. 

They have supplied you with a csv file called `"bank_marketing.csv"`, which you will need to clean, reformat, and split, in order to save separate files based on the tables you will create. It is recommended to use `pandas` for these tasks.

Lastly, you will write the SQL code that the bank can execute to create the tables and populate with the data from the csv files. As the bank are quite strict about their security, you'll save SQL files as multiline string variables that they can then use to create the database on their end. 

You have been asked to design a database that will have three tables:

## client

| column | data type | description | original column in dataset |
|--------|-----------|-------------|----------------------------|
| `id` | `serial` | Client ID - primary key | `client_id` |
| `age` | `integer` | Client's age in years | `age` |
| `job` | `text` | Client's type of job | `job` |
| `marital` | `text` | Client's marital status | `marital` | 
| `education` | `text` | Client's level of education | `education` |
| `credit_default` | `boolean` | Whether the client's credit is in default | `credit_default` |
| `housing` | `boolean` | Whether the client has an existing housing loan (mortgage) | `housing` | 
| `loan` | `boolean` | Whether the client has an existing personal loan | `loan` |

<br>

## campaign

| column | data type | description | original column in dataset |
|--------|-----------|-------------|----------------------------|
| `campaign_id` | `serial` | Campaign ID - primary key | N/A - new column |
| `client_id` | `serial` | Client ID - references `id` in the `client` table | `client_id` |
| `number_contacts` | `integer` | Number of contact attempts to the client in the current campaign | `campaign` |
| `contact_duration` | `integer` | Last contact duration in seconds | `duration` |
| `pdays` | `integer` | Number of days since contact in previous campaign (`999` = not previously contacted) | `pdays` |
| `previous_campaign_contacts` | `integer` | Number of contact attempts to the client in the previous campaign | `previous` |
| `previous_outcome` | `boolean` | Outcome of the previous campaign | `poutcome` |
| `campaign_outcome` | `boolean` | Outcome of the current campaign | `y` |
| `last_contact_date` | `date` | Last date the client was contacted | A combination of `day`, `month`, and the newly created `year` |

<br>

## economics

| column | data type | description | original column in dataset |
|--------|-----------|-------------|----------------------------|
| `client_id` | `serial` | Client ID - references `id` in the `client` table | `client_id` |
| `emp_var_rate` | `float` | Employment variation rate (quarterly indicator) | `emp_var_rate` |
| `cons_price_idx` | `float` | Consumer price index (monthly indicator) | `cons_price_idx` |
| `euribor_three_months` | `float` | Euro Interbank Offered Rate (euribor) three month rate (daily indicator) | `euribor3m` |
| `number_employed` | `float` | Number of employees (quarterly indicator)| `nr_employed` |

# DATA IMPORTING

In [1]:
import pandas as pd
import numpy as np
import psycopg2
from sqlalchemy import create_engine


#Read in bank_marketing.csv as a pandas DataFrame.
df = pd.read_csv("bank_marketing.csv")

#Make all columns viewable 
pd.set_option('display.max_columns', None)

#View first few rows
print(df.head())

   client_id  age        job  marital    education credit_default housing  \
0          0   56  housemaid  married     basic.4y             no      no
1          1   57   services  married  high.school        unknown      no
2          2   37   services  married  high.school             no     yes
3          3   40     admin.  married     basic.6y             no      no
4          4   56   services  married  high.school             no      no

  loan    contact month  day  duration  campaign  pdays  previous  \
0   no  telephone   may   13       261         1    999         0
1   no  telephone   may   19       149         1    999         0
2   no  telephone   may   23       226         1    999         0
3   no  telephone   may   27       151         1    999         0
4  yes  telephone   may    3       307         1    999         0

      poutcome  emp_var_rate  cons_price_idx  cons_conf_idx  euribor3m  \
0  nonexistent           1.1          93.994          -36.4      4.857
1  nonexistent           1.1          93.994          -36.4      4.857
2  nonexistent           1.1          93.994          -36.4      4.857
3  nonexistent           1.1          93.994          -36.4      4.857
4  nonexistent           1.1          93.994          -36.4      4.857

   nr_employed   y
0       5191.0  no
1       5191.0  no
2       5191.0  no
3       5191.0  no
4       5191.0  no

# DATA SPLITTING TO THREE TABLES

In [2]:
#Generate the client table
client = df[['client_id', 'age', 'job', 'marital', 'education', 'credit_default', 'housing', 'loan']]

In [3]:
#Generate the campaign table
campaign = df[['client_id', 'campaign', 'duration', 'pdays', 'previous', 'poutcome', 'y', 'day', 'month']]

In [4]:
#Generate the economics table
economics = df[['client_id', 'emp_var_rate', 'cons_price_idx', 'euribor3m', 'nr_employed']]

# CLEANING THE DATA

## Identified issues

### Client Table
- Rename client_id column to id
- Replace '.' in the education column with '_'
- Convert unknown values in the education column to NULL
- Replace '.' in the job column with ''

### Campaign Table
- Create a new column called campaign_id. This will be the primary key for this table
- Rename campaign to number_contacts, duration to contact_duration, previous to previous_campaign, poutcome to previous_outcome, y to campaign_outcome.
- Replace '.' in the education column with '_'
- Convert nonexistent in the previous_outcome column to NULL
- Convert campaign_outcome column to binary
- Create a datetime column 'last_contact_date' with concatenated values from month and day columns
- Convert 'last_contact_date' to datetime
- Drop redundant columns

### Economics Table
- Rename euribor3m to euribor_three_months and nr_employed to number_employed

## Client table

In [5]:
# Renaming the client_id columnm to id
client = client.rename(columns = {'client_id': 'id'})

#Replace '.' in the education column with '_'
client['education'] = client['education'].str.replace('.', '_')

#Convert unknown values in the education column to NULL
client['education'] = client['education'].replace('unknown', np.NaN)

#Replace '.' in the job column with ''
client['job'] = client['job'].str.replace('.', '')

#Confirm correct cleaning of the client table
print(client.head())

   id  age        job  marital    education credit_default housing loan
0   0   56  housemaid  married     basic_4y             no      no   no
1   1   57   services  married  high_school        unknown      no   no
2   2   37   services  married  high_school             no     yes   no
3   3   40      admin  married     basic_6y             no      no   no
4   4   56   services  married  high_school             no      no  yes

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_15480\941826090.py:5: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  client['education'] = client['education'].str.replace('.', '_')
C:\Users\LENOVO\AppData\Local\Temp\ipykernel_15480\941826090.py:11: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  client['job'] = client['job'].str.replace('.', '')

## Campaign table

In [6]:
#Rename columns
campaign = campaign.rename(columns={'campaign':'number_contacts', 'duration':'contact_duration','previous':'previous_campaign_contacts','poutcome':'previous_outcome', 'y':'campaign_outcome' })

#Convert campaign_outcome column to binary
outcome_received = {'no':0, 'yes':1 }
campaign['campaign_outcome']=campaign['campaign_outcome'].map(outcome_received)

#Convert nonexistent in the previous_outcome column to NULL
campaign['previous_outcome']= campaign['previous_outcome'].replace('nonexistent', np.NaN)

#Convert previous_outcome column to binary
previous_outcome_received = {'failure':0, 'success':1 }
campaign['previous_outcome']=campaign['previous_outcome'].map(previous_outcome_received)

#Add a column 'campaign_id', with all rows containing the value '1'
campaign['campaign_id']= 1

#Add a column 'year', with all rows containing the value '2022'
campaign['year']= '2022'

#Capitalise month column
campaign['month']= campaign['month'].str.capitalize()

#Convert day column to string
campaign['day']= campaign['day'].astype(str)

#Create a datetime column 'last_contact_date' with concatenated values from month and day columns
campaign['last_contact_date'] = campaign['year']+ '-' + campaign['month'] + '-' + campaign['day'] 

#Convert last_contact_date to datetime
campaign['last_contact_date'] = pd.to_datetime(campaign['last_contact_date'], format='%Y-%b-%d')

#Drop redundant columns
campaign.drop(columns=['year','month', 'day'], inplace=True)


#Confirm correct cleaning of the client table
print(campaign.head())

   client_id  number_contacts  contact_duration  pdays  \
0          0                1               261    999
1          1                1               149    999
2          2                1               226    999
3          3                1               151    999
4          4                1               307    999

   previous_campaign_contacts  previous_outcome  campaign_outcome  \
0                           0               NaN                 0
1                           0               NaN                 0
2                           0               NaN                 0
3                           0               NaN                 0
4                           0               NaN                 0

   campaign_id last_contact_date
0            1        2022-05-13
1            1        2022-05-19
2            1        2022-05-23
3            1        2022-05-27
4            1        2022-05-03

## Economics table

In [7]:
#Rename columns
economics = economics.rename(columns={'euribor3m':'euribor_three_months', 'nr_employed':'number_employed' })

#Confirm correct cleaning of the economics table
print(economics.head())

   client_id  emp_var_rate  cons_price_idx  euribor_three_months  \
0          0           1.1          93.994                 4.857
1          1           1.1          93.994                 4.857
2          2           1.1          93.994                 4.857
3          3           1.1          93.994                 4.857
4          4           1.1          93.994                 4.857

   number_employed
0           5191.0
1           5191.0
2           5191.0
3           5191.0
4           5191.0

# Saving The Data

In [8]:
# saving the dataframe
client.to_csv('client.csv', index=False)

# saving the dataframe
campaign.to_csv('campaign.csv', index=False)

# saving the dataframe
economics.to_csv('economics.csv', index=False)

### Create a Python variable called client_table, containing SQL code as a multi-line string to create a table called client using values from client.csv.

In [9]:
# Specify the SQL code as a multi-line string
client_table = """
CREATE TABLE client (
    id SERIAL PRIMARY KEY,
    age INT,
    job TEXT,
    marital TEXT,
    education TEXT,
    credit_default BOOLEAN,
    housing BOOLEAN,
    loan BOOLEAN
);

-- Copy data from client.csv into the client table
\copy client FROM 'client.csv' DELIMITER ',' CSV HEADER;
"""

### Create a Python variable called campaign_table, containing SQL code as a multi-line string to create a table called campaign using values from campaign.csv.

In [10]:
# Specify SQL code as a multi-line string
campaign_table = """"
CREATE TABLE campaign (
    campaign_id SERIAL PRIMARY KEY,
    client_id SERIAL REFERENCES client (id),
    number_contacts INT,
    contact_duration INT,
    pdays INT,
    previous_campaign_contacts INT,
    previous_outcome BOOLEAN,
    campaign_outcome BOOLEAN,
    last_contact_date DATE
);

-- Copy data from campaign.csv into the campaign table
\copy campaign FROM 'campaign.csv' DELIMETER ',' CSV HEADER;
"""

### Create a Python variable called economics_table, containing SQL code as a multi-line string to create a table called economics using values from economics.csv.

In [11]:
# Specify SQL code as a multi-line string
economics_table = """
CREATE TABLE economics (
    client_id SERIAL REFERENCES client (id),
    emp_var_rate FLOAT,
    cons_price_idx FLOAT,
    euribor_three_months FLOAT,
    number_employed FLOAT
);

-- Copy data from economics.csv into the economics table
\copy economics FROM 'economics.csv' DELIMETER ',' CSV HEADER;
"""

# Connecting to the database and creating new tables

In [13]:
# import library
import psycopg2
from sqlalchemy import create_engine

# Specify parameters
# You get these parameters from your postgresSQL DBMS server properties
hostname = 'localhost'
database = 'Bank_Marketing_Database'
username = 'postgres'
password = '*******'
port_id = 5432

# Provide connection parameters
conn = psycopg2.connect(
    host=hostname,
    database=database,
    user=username,
    password=password,
    port=port_id
)

In [14]:
# Create engine
# connection string: dialect+driver://user:password@server/database
engine = create_engine('postgresql+psycopg2://postgres:*******@localhost/Bank_Marketing_Database')

In [15]:
# Display engine info
engine

Engine(postgresql+psycopg2://postgres:***@localhost/Bank_Marketing_Database)

In [21]:
# Insert data from client DataFrame into the "client_data" table
client.to_sql('client_data', engine, if_exists='replace', index=False)

# Insert data from campaign DataFrame into the "campaign_data" table
campaign.to_sql('campaign_data', engine, if_exists='replace', index=False)

# Insert data from economics DataFrame into the "economics_data" table
economics.to_sql('economics_data', engine, if_exists='replace', index=False)

188

In [22]:
# Confirm if all three tables were successfully created 
# and if all the data was successfully inserted into the three different tables

# Read client_data from database to pandas dataframe
client_df = pd.read_sql_query('SELECT * FROM client_data', engine)
client_df

,id,age,job,marital,education,credit_default,housing,loan
0,0,56,housemaid,married,basic_4y,no,no,no
1,1,57,services,married,high_school,unknown,no,no
2,2,37,services,married,high_school,no,yes,no
3,3,40,admin,married,basic_6y,no,no,no
4,4,56,services,married,high_school,no,no,yes
...,...,...,...,...,...,...,...,...
41183,41183,73,retired,married,professional_course,no,yes,no
41184,41184,46,blue-collar,married,professional_course,no,no,no
41185,41185,56,retired,married,university_degree,no,yes,no
41186,41186,44,technician,married,professional_course,no,no,no
41187,41187,74,retired,married,professional_course,no,yes,no

In [23]:
# Read campaign_data from database to pandas dataframe
campaign_df = pd.read_sql_query('SELECT * FROM campaign_data', engine)
campaign_df

,client_id,number_contacts,contact_duration,pdays,previous_campaign_contacts,previous_outcome,campaign_outcome,campaign_id,last_contact_date
0,0,1,261,999,0,NaN,0,1,2022-05-13
1,1,1,149,999,0,NaN,0,1,2022-05-19
2,2,1,226,999,0,NaN,0,1,2022-05-23
3,3,1,151,999,0,NaN,0,1,2022-05-27
4,4,1,307,999,0,NaN,0,1,2022-05-03
...,...,...,...,...,...,...,...,...,...
41183,41183,1,334,999,0,NaN,1,1,2022-11-30
41184,41184,1,383,999,0,NaN,0,1,2022-11-06
41185,41185,2,189,999,0,NaN,0,1,2022-11-24
41186,41186,1,442,999,0,NaN,1,1,2022-11-17
41187,41187,3,239,999,1,0.0,0,1,2022-11-23

In [24]:
# Read economics_data from database to pandas dataframe
economics_df = pd.read_sql_query('SELECT * FROM economics_data', engine)
economics_df

,client_id,emp_var_rate,cons_price_idx,euribor_three_months,number_employed
0,0,1.1,93.994,4.857,5191.0
1,1,1.1,93.994,4.857,5191.0
2,2,1.1,93.994,4.857,5191.0
3,3,1.1,93.994,4.857,5191.0
4,4,1.1,93.994,4.857,5191.0
...,...,...,...,...,...
41183,41183,-1.1,94.767,1.028,4963.6
41184,41184,-1.1,94.767,1.028,4963.6
41185,41185,-1.1,94.767,1.028,4963.6
41186,41186,-1.1,94.767,1.028,4963.6
41187,41187,-1.1,94.767,1.028,4963.6